БухЭксп/InformationRegisters/CW_Переводы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_Переводы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Перевод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектПеревода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыПереводов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>600</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/CommonModules/CW_Переводы_ПИ/Ext/Module.bsl
//Устарела. Слеудет использовать CW_ПереводыСервер.ПолучитьПеревод()
Функция Перевести(ОбъектПеревода, Язык, ОсновнойЯзык = Неопределено, ВозвращатьПредставлениеОбъектаПриОтсутствииПеревода = Истина) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_Переводы.ОбъектПеревода КАК ОбъектПеревода,
	|	CW_Переводы.Перевод КАК Перевод
	|ИЗ
	|	РегистрСведений.CW_Переводы КАК CW_Переводы
	|ГДЕ
	|	CW_Переводы.ОбъектПеревода = &ОбъектПеревода
	|	И CW_Переводы.Язык = &Язык";
	
	Запрос.УстановитьПараметр("ОбъектПеревода"	, ОбъектПеревода);
	Запрос.УстановитьПараметр("Язык"			, Язык); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Перевод; 
	Иначе
		Если ВозвращатьПредставлениеОбъектаПриОтсутствииПеревода Тогда
			Возврат Строка(ОбъектПеревода);
		КонецЕсли;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции
